read_verilog -sv -nolatches ../verilog/4bit_adder.sv
synth -flatten
aigmap
write_aiger -ascii -symbols ../aiger-examples/4bit-adder.aag
